# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [141]:
# Your code here

import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')

df.columns = ['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount']

df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [142]:
# Your code here
df['gender'].unique()

df['gender'] = df['gender'].map({'Male': 'M', 'Female': 'F', 'Femal': 'F', 'female': 'F', 'M':'M','F':'F'})

df['state'].unique()

df['state'] = df['state'].map({'Washington':'Washington',
                               'Arizona':'Arizona',
                               'Nevada':'Nevada',
                               'California':'California',
                               'Oregon':'Oregon',
                               'Cali': 'California',
                               'AZ': 'Arizona',
                               'WA': 'Washington'})

df['education'].unique()
df['education'] = df['education'].replace('Bachelors','Bachelor')

df['customer_lifetime_value'].unique()
df['customer_lifetime_value'] = df['customer_lifetime_value'].str.replace('%','')

df['vehicle_class'].unique()

df['vehicle_class'] = df['vehicle_class'].replace('Sports Car','Luxury')
df['vehicle_class'] = df['vehicle_class'].replace('Luxury SUV','Luxury')
df['vehicle_class'] = df['vehicle_class'].replace('Luxury Car','Luxury')

df['vehicle_class'].unique()

df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [143]:
# Your code here

df['customer_lifetime_value'].unique()

df['customer_lifetime_value'] = pd.to_numeric(df['customer_lifetime_value'], errors = 'coerce')

df['number_of_open_complaints'].unique()
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.replace('/00','')
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.replace('1/','')
df['number_of_open_complaints'] = pd.to_numeric(df['number_of_open_complaints'], errors = 'coerce') #.fillna(0)


df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [130]:
# Your code here

df.isna().sum()
#df['customer_lifetime_value'] = df['customer_lifetime_value'].fillna(0)
#df['number_of_open_complaints'] = df['number_of_open_complaints'].fillna(0)

df = df.dropna(how='all') # Rows with all characters NaN do not give information, we can discard them.
df['customer_lifetime_value'] = df['customer_lifetime_value'].fillna(df['customer_lifetime_value'].mean())

df.isna().sum()

# There are still NaN in gender, but filling them with other values would not represent the real data

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        0
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [133]:
# Your code here

df.duplicated().sum()

# There are no duplicates rows in the dataset.

df.drop_duplicates(inplace=True) # we know there are none but this is how we would do it

df.duplicated().sum()

0

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [147]:
# Your code here

df1 = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')

df1.head()
def limpito(datitos: pd.DataFrame):
    dataframe = datitos.copy()
    # Todas las columnas en minuscula y espacio por _:
    dataframe.columns = [x.lower().replace(' ','_') for x in dataframe.columns]
    # Cambiar columna st por state
    dataframe.columns = [x.replace('st','state') if x == 'st' else x for x in dataframe.columns ]
    # Unificar valores en columnas
    dataframe['gender'] = dataframe['gender'].map({'Male':      'M', 
                                                   'Female':    'F', 
                                                   'Femal':     'F', 
                                                   'female':    'F', 
                                                   'M':         'M',
                                                   'F':         'F'})

    dataframe['state'] = dataframe['state'].map({'Washington':'Washington',
                                'Arizona':'Arizona',
                                'Nevada':'Nevada',
                                'California':'California',
                                'Oregon':'Oregon',
                                'Cali': 'California',
                                'AZ': 'Arizona',
                                'WA': 'Washington'})

    dataframe['education'] = dataframe['education'].replace('Bachelors','Bachelor')

    dataframe['customer_lifetime_value'] = dataframe['customer_lifetime_value'].str.replace('%','')

    dataframe['vehicle_class'] = dataframe['vehicle_class'].replace('Sports Car','Luxury')
    dataframe['vehicle_class'] = dataframe['vehicle_class'].replace('Luxury SUV','Luxury')
    dataframe['vehicle_class'] = dataframe['vehicle_class'].replace('Luxury Car','Luxury')

    # Forzar numericos:

    dataframe['customer_lifetime_value'] = pd.to_numeric(df['customer_lifetime_value'], errors = 'coerce')
     
    dataframe['number_of_open_complaints'] = dataframe['number_of_open_complaints'].str.replace('/00','')
    dataframe['number_of_open_complaints'] = dataframe['number_of_open_complaints'].str.replace('1/','')
    dataframe['number_of_open_complaints'] = pd.to_numeric(dataframe['number_of_open_complaints'], errors = 'coerce')

    # Corregir valores NaN:

    dataframe = dataframe.dropna(how='all') # Rows with all characters NaN do not give information, we can discard them.
    dataframe['customer_lifetime_value'] = dataframe['customer_lifetime_value'].fillna(dataframe['customer_lifetime_value'].mean())
    
    # Detectar si hay duplicados:

    if dataframe.duplicated().sum() == 0:
        print('No hay duplicados')
    else:
        print('Duplicated rows need removing')
        dataframe.drop_duplicates(inplace=True)
        print('Duplicated rows have been removed')
    
    return dataframe

dataframe2 = limpito(df1)
dataframe2.head()

No hay duplicados

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,7.936903e+05,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6.979536e+05,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1.288743e+06,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7.645862e+05,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,5.363077e+05,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. 
    - Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. 
    - Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [160]:
# Your code here

dataframe2.describe()
clv_25 = dataframe2['customer_lifetime_value'].quantile(0.25) 
pca_75 = dataframe2['total_claim_amount'].quantile(0.75)


condition = (dataframe2['customer_lifetime_value'] <= clv_25) & (dataframe2['total_claim_amount'] >= pca_75)
filtered_df = dataframe2[condition]
filtered_df[['customer_lifetime_value','total_claim_amount']].describe()

       customer_lifetime_value  total_claim_amount
count                41.000000           41.000000
mean             340056.269512          719.118612
std               57043.699118          150.389974
min              228759.690000          532.800000
25%              289873.270000          632.715382
50%              365253.240000          679.368378
75%              387364.700000          799.200000
max              402381.440000         1185.988301